# What are the SQL queries that you will use to get the below data points?

1. Write a SQL query to get the second highest marks from Table 1. For example, given the the query should return 40 as the second highest marks. If there are no second highest marks, then the query should return null. Provide 2 different solutions for the above problem. ?
2. Provide 2 different ways to find duplicate emails from Table 1 ?
3. write a SQL query to find all dates/Ids with higher temperature compared to its previous dates ?
4. Write a SQL query to find employees who have the highest salary in each of the departments in table 3. For the above tables, your SQL query should return the following rows (order of rows does not matter)  ?

In [16]:
#Creating Databases in MySQL

import mysql.connector
mydb = mysql.connector.connect(host="localhost", user="root",  password="#meKRISH30")
print(mydb)
cursor = mydb.cursor()

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000027EB59FFBB0>

In [17]:
cursor.execute('SHOW DATABASES')
for database in cursor:
    print(database)

('abc',)
('business',)
('cantilever',)
('games2win',)
('grofers',)
('information_schema',)
('krish',)
('mysql',)
('performance_schema',)
('pharm_easy',)
('sales',)
('sys',)

In [18]:
# sql_mode=only_full_group_by

sql= "SET sql_mode=(SELECT REPLACE(@@sql_mode,'ONLY_FULL_GROUP_BY',''))"
cursor.execute(sql)
mydb.commit()

In [19]:
# -selected database

cursor.execute('use grofers')

In [20]:
#Show tables

sql= "show tables"
cursor.execute(sql)

for database in cursor:
    print(database)

('table1',)
('table2',)
('table3',)

In [21]:
#0.1 #Q0  Table1.

sql= "select * from Table1 "
cursor.execute(sql)
myresult= cursor.fetchall()

for x in myresult:
  print(x)

('1', 'GRO 01', '10', 'a@grofers.com')
('2', 'GRO 02', '20', 'b@grofers.com')
('3', 'GRO 03', '30', 'c@grofers.com')
('4', 'GRO 04', '40', 'c@grofers.com')
('5', 'GRO 05', '45.5', 'd@grofers.com')

In [22]:
#0.2 #Q0  Table2

sql= "select * from Table2 "
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('1', '2018-03-01', '2020-02-01 20:20:20', '16')
('2', '2018-05-03', '2020-02-02 07:40:30', '17')
('3', '2018-06-04', '2020-02-03 12:10:50', '14')
('4', '2018-07-05', '2020-02-04 10:50:42', '18')
('5', '2018-08-06', '2020-02-05 17:30:40', '19')
('6', '2018-09-07', '2020-02-06 19:26:46', '18')
('7', '2018-11-15', '2020-02-07 15:36:56', '19')
('8', '2019-10-24', '2020-02-08 05:30:06', '20')
('9', '2020-07-01', None, '21')

In [23]:
#0.3 #Q0  Table3

sql= "select * from Table3 "
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('1', 'Karan', '80000', '1')
('2', 'Arjun', '70000', '2')
('3', 'Vikram', '60000', '1')
('4', 'Rahul', '50000', '2')
('5', 'Jassi', '90000', '1')
('6', 'Ajay', '20000', '1')
('7', 'Bijay', '49000', '2')
('8', 'karan', '57000', '1')
('9', 'eftn', '30000', '2')
('10', 'krish', '90000', '1')

In [24]:
#1.2  #Q1. Write a SQL query to get the second highest marks from Table 1. For example, given
# the the query should return 40 as the second highest marks. If there are no second highest
# marks, then the query should return null. Provide 2 different solutions for the above problem.

sql= "SELECT * from (select ROW_NUMBER() over(order by Marks desc) as rnk, Marks from table1)sub where rnk=2;"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

(2, '40')

In [25]:
#2.1 #Q2. Provide 2 different ways to find duplicate emails from Table 1.

sql= "select A.ID,A.Marks,A.Email from table1 as A inner join (select Email from table1 group by Email having count(Email)>1) as B on A.Email=B.Email ; "
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('3', '30', 'c@grofers.com')
('4', '40', 'c@grofers.com')

In [26]:
#2.2 #Q2. Provide 2 different ways to find duplicate emails from Table 1.

sql= " SELECT ID,Marks,Email FROM table1  WHERE Email in (SELECT Email FROM table1  GROUP BY Email  HAVING count(Email) > 1);"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('3', '30', 'c@grofers.com')
('4', '40', 'c@grofers.com')

In [27]:
#  #Q3. Refer table 2, write a SQL query to find all dates/Ids with higher temperature compared
# to its previous dates.


#wrong
sql= " select ID,Date,Temperature from (select ID,Date,Temperature, LAG(Temperature,1,16) OVER(order by ID) as Temp2 from table2)sub where Temperature>Temp2"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('2', '2018-05-03', '17')
('4', '2018-07-05', '18')
('5', '2018-08-06', '19')
('7', '2018-11-15', '19')
('8', '2019-10-24', '20')
('9', '2020-07-01', '21')

In [28]:
#  #Q4. Write a SQL query to find employees who have the highest salary in each of the 
#departments in table 3. For the above tables, your SQL query should return the following
# rows (order of rows does not matter).

sql= "select * from (select ROW_NUMBER() OVER(PARTITION BY Department order by Salary desc) as rnk, Department,Name as Employee,Salary from table3) SUB where rnk=1  ; "
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

(1, '1', 'Jassi', '90000')
(1, '2', 'Arjun', '70000')

In [29]:
#  #Q4. Write a SQL query to find employees who have the highest salary in each of the 
#departments in table 3. For the above tables, your SQL query should return the following
# rows (order of rows does not matter).

sql= "select Department,Name as Employee,max(Salary) as Salary from Table3 group by Department order by Salary desc ; "
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('1', 'Karan', '90000')
('2', 'Arjun', '70000')

In [35]:
# What is Windo Function ?
# Rank and Dense Rank Diff ?
# What is Wild Card